CommunityGD32Cores/gd32-pio-wifi-sdk/NSPE/WIFI_IOT/bsp/flash_api.c
/*!
    \file    flash_api.c
    \brief   Flash API for GD32W51x WiFi SDK

    \version 2021-10-30, V1.0.0, firmware for GD32W51x
*/

/*
    Copyright (c) 2021, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "bsp_inc.h"
#include "stddef.h"
#include "flash_api.h"
#include "gd32w51x.h"
#include "string.h"

// #define FLASH_MAPPED_BASE          0x90000000
#define WORD_SIZE                     (4U)

#define WRITE_ENABLE_CMD              0x06
#define WRITE_DISABLE_CMD             0x04
#define READ_STATUS_REG1_CMD          0x05
#define WRITE_STATUS_REG1_CMD         0x01
#define QUAD_IN_FAST_PROG_CMD         0x32
#define QUAD_OUT_FAST_READ_CMD        0x6B
#define SECTOR_ERASE_CMD              0x20    // 0xD8
#define HIGH_PERFORMANCE_CMD          0xA3

#define FLASH_READ16(base, addr)    *(uint16_t *)(base + addr)

uint32_t ISER[8] = {0};
uint32_t systick_ctrl;

/*!
    \brief      get flash cache enabled state
    \param[in]  none
    \param[out] none
    \retval     result of state(1: enabled, or 0: disabled)
*/
int is_flash_cache_enabled(void)
{
    if (ICACHE_CTL & ICACHE_CTL_EN)
        return 1;
    else
        return 0;
}

/*!
    \brief      disable flash cache
    \param[in]  none
    \param[out] none
    \retval     0
*/
int flash_cache_disable(void)
{
    icache_disable();
    return 0;
}

/*!
    \brief      enable flash cache
    \param[in]  none
    \param[out] none
    \retval     0
*/
int flash_cache_enable(void)
{
    icache_enable();
    return 0;
}

/*!
    \brief      check memory structure is SIP Flash or EXT Flash
    \param[in]  none
    \param[out] none
    \retval     memory structure(1: FMC mode: SIP Flash, 0: EXT Flash)
*/
int is_sip_flash(void)
{
    return (OBSTAT_NQSPI() == SET);
}

/*!
    \brief      get flash offset valid state
    \param[in]  offset: flash offset
    \param[out] none
    \retval     result of state(1: offset is valid, or 0: offset is invalid)
*/
int is_valid_flash_offset(uint32_t offset)
{
    if (offset < flash_total_size()) {
        return 1;
    }
    return 0;
}

/*!
    \brief      get flash addr valid state
    \param[in]  addr: flash address
    \param[out] none
    \retval     result of state(1: addr is valid, or 0: addr is not valid)
*/
int is_valid_flash_addr(uint32_t addr)
{
    int bvalid = 0;
    if ((addr >= FLASH_BASE) && (addr < (FLASH_BASE + flash_total_size()))) {
        bvalid = 1;
    }
    return bvalid;
}

/*!
    \brief      get flash total size
    \param[in]  none
    \param[out] none
    \retval     flash total size
*/
uint32_t flash_total_size(void)
{
    return FLASH_TOTAL_SIZE;
}

/*!
    \brief      get flash erase size
    \param[in]  none
    \param[out] none
    \retval     flash erase size. sip flash page size or qspi sector size
*/
uint32_t flash_erase_size(void)
{
    if (is_sip_flash()) {
        return FLASH_SIP_PAGE_SIZE;
    } else {
        return FLASH_QSPI_SECTOR_SIZE;
    }
}

/*!
    \brief      configure no real time decrypt areas for flash
    \param[in]  nd_idx: no decrypt register index
    \param[in]  start_page: start page of no real time decrypt area
    \param[in]  end_page: end page of no real time decrypt area
    \param[out] none
    \retval     none
*/
void flash_nodec_config(uint32_t nd_idx, uint32_t start_page, uint32_t end_page)
{
    if (is_sip_flash()) {
        /* unlock the flash program erase controller */
        fmc_unlock();
        /* unlock the option byte operation (include SECWM/HDP/WRP/NODEC/OFRG/OFVR) */
        ob_unlock();
        /* clear pending flags */
        fmc_flag_clear(FMC_FLAG_END | FMC_FLAG_WPERR);

        /* set no OTFDEC region for sip flash */
        fmc_no_rtdec_config(start_page, end_page, nd_idx);

        /* lock the option byte operation */
        ob_lock();
        /* lock the flash program erase controller */
        fmc_lock();
    }
}

/*!
    \brief      config flash offset region and value
    \param[in]  of_spage: start page of offset region, 0~0x1FFF
    \param[in]  of_epage: end page of offset region, 0~0x1FFF
    \param[in]  of_value: offset value, 0~0x1FFF
    \param[out] none
    \retval     none
*/
void flash_offset_mapping(uint32_t of_spage, uint32_t of_epage, uint32_t of_value)
{
    fmc_unlock();
    ob_unlock();
    fmc_offset_region_config(of_spage, of_epage);
    fmc_offset_value_config(of_value);
    ob_lock();
    fmc_lock();
}

/*!
    \brief      initialize flash
    \param[in]  none
    \param[out] none
    \retval     0
*/
int flash_init(void)
{
    if (!is_sip_flash()) {
        qspi_flash_config(3);
    }
    return 0;
}

/*!
    \brief      lock flash write
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void flash_write_lock(void)
{
    uint8_t i;

    for (i = 0; i < 8; i++) {
        ISER[i] = NVIC->ISER[i];
        NVIC->ICER[i] = 0xffffffff;  // disable interrupts
        NVIC->ICPR[i] = 0xffffffff;  // clear pending interrupts
    }

    systick_ctrl = SysTick->CTRL;    // disable systick
    SysTick->CTRL = 0;
}

/*!
    \brief      unlock flash write
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void flash_write_unlock(void)
{
    uint8_t i;

    for (i = 0; i < 8; i++) {
        NVIC->ISER[i] = ISER[i];  // restore interrupts
    }

    SysTick->CTRL = systick_ctrl;  // restore systick
}

/*!
    \brief      configure QSPI GPIO
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void qspi_flash_gpio_config(void)
{
    rcu_periph_clock_enable(RCU_GPIOA);
    rcu_periph_clock_enable(RCU_GPIOB);

    gpio_af_set(GPIOA, GPIO_AF_3, GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7);
    gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7);
    gpio_output_options_set(GPIOA, GPIO_OTYPE_PP, GPIO_OSPEED_25MHZ, GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7);

    gpio_af_set(GPIOB, GPIO_AF_3, GPIO_PIN_3 | GPIO_PIN_4);
    gpio_mode_set(GPIOB, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_3 | GPIO_PIN_4);
    gpio_output_options_set(GPIOB, GPIO_OTYPE_PP, GPIO_OSPEED_25MHZ, GPIO_PIN_3 | GPIO_PIN_4);
}

/*!
    \brief      enable qspi flash write
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void qspi_flash_write_enable(void)
{
    qspi_command_struct sCommand;
    qspi_autopolling_struct sConfig;

    /* Enable write operations ------------------------------------------ */
    sCommand.instruction_mode      = QSPI_INSTRUCTION_1_LINE;
    sCommand.instruction           = WRITE_ENABLE_CMD;
    sCommand.addr_mode             = QSPI_ADDR_NONE;
    sCommand.addr_size             = QSPI_ADDR_24_BITS;
    sCommand.addr                  = 0;
    sCommand.altebytes_mode        = QSPI_ALTE_BYTES_NONE;
    sCommand.altebytes_size        = QSPI_ALTE_BYTES_8_BITS;
    sCommand.altebytes             = 0;
    sCommand.dummycycles           = 0;
    sCommand.data_mode             = QSPI_DATA_NONE;
    sCommand.data_length           = 0;
    sCommand.sioo_mode             = QSPI_SIOO_INST_EVERY_CMD;

