CommunityGD32Cores/gd32-pio-wifi-sdk/NSPE/WIFI_IOT/bsp/flash_api.c
    qspi_command(&sCommand);

    /* Configure automatic polling mode to wait for write enabling ---- */
    sConfig.match                = 0x02;
    sConfig.mask                 = 0x02;
    sConfig.match_mode           = QSPI_MATCH_MODE_AND;
    sConfig.statusbytes_size     = 1;
    sConfig.interval             = 0x10;
    sConfig.auto_stop            = QSPI_AUTO_STOP_ENABLE;

    sCommand.instruction         = READ_STATUS_REG1_CMD;
    sCommand.data_mode           = QSPI_DATA_1_LINE;

    qspi_autopolling(&sCommand, &sConfig);
}

/*!
    \brief      configure automatic polling mode to wait for memory ready
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void qspi_flash_autopolling_ready(void)
{
    qspi_command_struct sCommand;
    qspi_autopolling_struct sConfig;

    /* Configure automatic polling mode to wait for memory ready ------ */
    sCommand.instruction_mode    = QSPI_INSTRUCTION_1_LINE;
    sCommand.instruction         = READ_STATUS_REG1_CMD;
    sCommand.addr_mode           = QSPI_ADDR_NONE;
    sCommand.addr_size           = QSPI_ADDR_24_BITS;
    sCommand.addr                = 0;
    sCommand.altebytes_mode      = QSPI_ALTE_BYTES_NONE;
    sCommand.altebytes_size      = QSPI_ALTE_BYTES_8_BITS;
    sCommand.altebytes           = 0;
    sCommand.dummycycles         = 0;
    sCommand.data_mode           = QSPI_DATA_1_LINE;
    sCommand.data_length         = 0;
    sCommand.sioo_mode           = QSPI_SIOO_INST_EVERY_CMD;

    sConfig.match                = 0x00;
    sConfig.mask                 = 0x01;
    sConfig.match_mode           = QSPI_MATCH_MODE_AND;
    sConfig.statusbytes_size     = 1;
    sConfig.interval             = 0x10;
    sConfig.auto_stop            = QSPI_AUTO_STOP_ENABLE;

    qspi_autopolling(&sCommand, &sConfig);
}

/*!
    \brief      configure qspi flash to quad mode
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void qspi_flash_set_quad(void)
{
    uint32_t id = 0;
    uint8_t mode_s = 0;
    uint16_t mode = 0;
    qspi_command_struct sCommand;

    qspi_flash_read_id(&id);

    qspi_flash_write_enable();

    sCommand.instruction        = READ_STATUS_REG1_CMD;
    sCommand.addr_mode          = QSPI_ADDR_NONE;
    sCommand.altebytes_mode     = QSPI_ALTE_BYTES_NONE;
    sCommand.dummycycles        = 0;
    sCommand.data_mode          = QSPI_DATA_1_LINE;
    sCommand.data_length        = 1;
    qspi_command(&sCommand);
    qspi_receive(&mode_s);

    mode |= (uint16_t)mode_s;

    sCommand.instruction        = READ_STATUS_REG_CMD;
    sCommand.addr_mode          = QSPI_ADDR_NONE;
    sCommand.altebytes_mode     = QSPI_ALTE_BYTES_NONE;
    sCommand.dummycycles        = 0;
    sCommand.data_mode          = QSPI_DATA_1_LINE;
    sCommand.data_length        = 1;
    qspi_command(&sCommand);
    qspi_receive(&mode_s);

    mode |= (uint16_t)mode_s << 8;

    if (mode & 0x0200) {
        /* quad mode, do nothing */
    } else {
        switch ((id & 0x00ff0000) >> 16) {
        case 0x16:                                       //GD32Q32
        case 0x17:                                       //GD32Q64
        case 0x18:                                       //GD32Q128
            mode = mode >> 8;
            mode |= 0x02;
            sCommand.instruction = WRITE_STATUS_REG_CMD;//write flash status[s15-s8]
            sCommand.addr_mode   = QSPI_ADDR_NONE;
            sCommand.addr        = 0;
            sCommand.data_mode   = QSPI_DATA_1_LINE;
            sCommand.data_length = 1;
            sCommand.dummycycles = 0;
            qspi_command(&sCommand);
            qspi_transmit((uint8_t *)&mode);
            break;
        case 0x14:                                       //GD32Q80
        case 0x15:                                       //GD32Q16
        case 0x19:                                       //GD32Q256
        default:
            mode |= (0x0200);
            sCommand.instruction = WRITE_STATUS_REG1_CMD;//write flash status[s15-s0]
            sCommand.addr_mode   = QSPI_ADDR_NONE;
            sCommand.addr        = 0;
            sCommand.data_mode   = QSPI_DATA_1_LINE;
            sCommand.data_length = 2;
            sCommand.dummycycles = 0;
            qspi_command(&sCommand);
            qspi_transmit((uint8_t *)&mode);
            break;
        }

        qspi_flash_autopolling_ready();
    }
}

/*!
    \brief      configure qspi flash
    \param[in]  clock_prescaler: prescaler of qspi clock
    \param[out] none
    \retval     none
*/
void qspi_flash_config(uint32_t clock_prescaler)
{
    qspi_init_struct Init;
    qspi_command_struct sCommand;

    // rcu_periph_clock_enable(RCU_GTZC);
    // tzgpc_tzspc_peripheral_attributes_config(TZGPC_PERIPH_QSPI_FLASHREG, TZGPC_TZSPC_PERIPH_SEC);

    qspi_flash_gpio_config();

    // qspi_deinit();
    rcu_periph_clock_enable(RCU_QSPI);

    Init.prescaler            = clock_prescaler;  /* QSPI clock = AHBCLK/(ClockPrescaler+1) */
    Init.fifo_threshold       = 4;
    Init.sample_shift         = QSPI_SAMPLE_SHIFTING_HALFCYCLE;  // QSPI_SAMPLE_SHIFTING_NONE;
    Init.flash_size           = 23;  /* 2^(FlashSize+1) ***** number of address bits = FlashSize + 1*/
    Init.cs_high_time         = QSPI_CS_HIGH_TIME_1_CYCLE;
    Init.clock_mode           = QSPI_CLOCK_MODE_0;
    qspi_init(&Init);

    sCommand.instruction_mode = QSPI_INSTRUCTION_1_LINE;
    sCommand.instruction      = 0;
    sCommand.addr_mode        = QSPI_ADDR_NONE;
    sCommand.addr_size        = QSPI_ADDR_24_BITS;
    sCommand.addr             = 0;
    sCommand.altebytes_mode   = QSPI_ALTE_BYTES_NONE;
    sCommand.altebytes_size   = QSPI_ALTE_BYTES_8_BITS;
    sCommand.altebytes        = 0;
    sCommand.dummycycles      = 0;
    sCommand.data_mode        = QSPI_DATA_NONE;
    sCommand.data_length      = 0;
    sCommand.sioo_mode        = QSPI_SIOO_INST_EVERY_CMD;

    qspi_flash_set_quad();

}

/*!
    \brief      read qspi flash device id
    \param[in]  None
    \param[out] None
    \retval     0
*/
int32_t qspi_flash_read_id(void *id)
{
    qspi_command_struct sCommand = {0};

    sCommand.instruction_mode = QSPI_INSTRUCTION_1_LINE;
    sCommand.instruction      = CHIP_READ_ID_CMD;
    sCommand.dummycycles      = 0;
    sCommand.data_mode        = QSPI_DATA_1_LINE;
    sCommand.data_length      = 3;
    sCommand.sioo_mode        = QSPI_SIOO_INST_EVERY_CMD;
    qspi_command(&sCommand);
    qspi_receive(id);

