CommunityGD32Cores/gd32-pio-wifi-sdk/NSPE/WIFI_IOT/bsp/flash_api.c
    return 0;
}

/*!
    \brief      erase qspi flash sector
    \param[in]  address: qspi flash address
    \param[out] none
    \retval     0
*/
int32_t qspi_flash_sector_erase(uint32_t address)
{
    qspi_command_struct sCommand;

    qspi_flash_write_enable();
    sCommand.instruction_mode = QSPI_INSTRUCTION_1_LINE;
    sCommand.instruction      = SECTOR_ERASE_CMD;
    sCommand.addr_mode        = QSPI_ADDR_1_LINE;
    sCommand.addr_size        = QSPI_ADDR_24_BITS;
    sCommand.addr             = address;
    sCommand.altebytes_mode   = QSPI_ALTE_BYTES_NONE;
    sCommand.altebytes_size   = QSPI_ALTE_BYTES_8_BITS;
    sCommand.altebytes        = 0;
    sCommand.dummycycles      = 0;
    sCommand.data_mode        = QSPI_DATA_NONE;
    sCommand.data_length      = 0;
    sCommand.sioo_mode        = QSPI_SIOO_INST_EVERY_CMD;
    qspi_command(&sCommand);
    qspi_flash_autopolling_ready();

    return 0;
}

/*!
    \brief      erase qspi flash full chip
    \param[in]  none
    \param[out] none
    \retval     0
*/
int32_t qspi_flash_chip_erase(void)
{
    qspi_command_struct sCommand;

    qspi_flash_write_enable();
    sCommand.instruction_mode = QSPI_INSTRUCTION_1_LINE;
    sCommand.instruction      = CHIP_ERASE_CMD;
    sCommand.addr_mode        = QSPI_ADDR_NONE;
    sCommand.addr_size        = QSPI_ADDR_8_BITS;
    sCommand.addr             = 0;
    sCommand.altebytes_mode   = QSPI_ALTE_BYTES_NONE;
    sCommand.altebytes_size   = QSPI_ALTE_BYTES_8_BITS;
    sCommand.altebytes        = 0;
    sCommand.dummycycles      = 0;
    sCommand.data_mode        = QSPI_DATA_NONE;
    sCommand.data_length      = 0;
    sCommand.sioo_mode        = QSPI_SIOO_INST_EVERY_CMD;
    qspi_command(&sCommand);
    qspi_flash_autopolling_ready();

    return 0;
}

/*!
    \brief      read qspi flash
    \param[in]  adress: flash's internal address to read from
    \param[out] data: pointer to the buffer that receives the data read from the flash
    \param[in]  size: size of data read from flash
    \retval     0
*/
int32_t qspi_flash_read(uint32_t address, void *data, uint32_t size)
{
    qspi_command_struct sCommand;

    sCommand.instruction_mode = QSPI_INSTRUCTION_1_LINE;
    sCommand.instruction      = QUAD_OUT_FAST_READ_CMD;
    sCommand.addr_mode        = QSPI_ADDR_1_LINE;
    sCommand.addr_size        = QSPI_ADDR_24_BITS;
    sCommand.addr             = address;
    sCommand.altebytes_mode   = QSPI_ALTE_BYTES_NONE;
    sCommand.altebytes_size   = QSPI_ALTE_BYTES_24_BITS;
    sCommand.altebytes        = 0;
    sCommand.dummycycles      = 8;
    sCommand.data_mode        = QSPI_DATA_4_LINES;
    sCommand.data_length      = size;
    sCommand.sioo_mode        = QSPI_SIOO_INST_EVERY_CMD;
    qspi_command(&sCommand);
    qspi_receive(data);

    return 0;
}

/*!
    \brief      program qspi flash page
    \param[in]  adress: flash's internal address to write to
    \param[in]  data: pointer to the buffer that receives the data read from the flash
    \param[in]  size: size of data read from flash
    \param[out] none
    \retval     0
*/
int32_t qspi_flash_page_program(uint32_t address, const uint8_t *data, uint32_t size)
{
    qspi_command_struct sCommand;

    /* Writing Sequence 4 Line------------------------------------------ */
    qspi_flash_write_enable();
    sCommand.instruction_mode = QSPI_INSTRUCTION_1_LINE;
    sCommand.instruction      = QUAD_IN_FAST_PROG_CMD;
    sCommand.addr_mode        = QSPI_ADDR_1_LINE;
    sCommand.addr_size        = QSPI_ADDR_24_BITS;
    sCommand.addr             = address;
    sCommand.altebytes_mode   = QSPI_ALTE_BYTES_NONE;
    sCommand.altebytes_size   = QSPI_ALTE_BYTES_8_BITS;
    sCommand.altebytes        = 0;
    sCommand.dummycycles      = 0;
    sCommand.data_mode        = QSPI_DATA_4_LINES;
    sCommand.data_length      = size;
    sCommand.sioo_mode        = QSPI_SIOO_INST_EVERY_CMD;
    qspi_command(&sCommand);
    qspi_transmit((uint8_t *)data);
    qspi_flash_autopolling_ready();

    return 0;
}

/*!
    \brief      read flash
    \param[in]  offset: flash offset
    \param[out] data: pointer to the buffer store flash read data
    \param[in]  len: length of data read from flash
    \retval     result of read flash(0: read ok, or -1: read error)
*/
int flash_read(uint32_t offset, void *data, int len)
{
    uint32_t i;
    uint32_t dst = (uint32_t)data;
    uint32_t left;

    if (!is_valid_flash_offset(offset) || data == NULL
        || len <= 0 || !is_valid_flash_offset(offset + len - 1)) {
        return -1;
    }

    if ((offset & 3) || (dst & 3)) {
        for (i = 0; i < len; i++) {
            ((uint8_t *)data)[i] = *(uint8_t *)(FLASH_BASE + offset + i);
        }
    } else {
        left = (len & 3);
        len -= left;
        for (i = 0; i < len; i += 4) {
            *(uint32_t *)(dst + i) = *(uint32_t *)(FLASH_BASE + offset + i);
        }
        if (left > 0)
            memcpy((uint8_t *)(dst + len), (uint8_t *)(FLASH_BASE + offset + len), left);
    }
    return 0;
}

/*!
    \brief      read flash indirectly
                consider encrypted image, two flash read api will be needed,
                one is directly read and flash value is decrypted, another is indirect
                read and no decryption is done.
    \param[in]  offset: flash offset
    \param[out] data: pointer to the buffer store flash read data
    \param[in]  len: length of data read from flash
    \retval     result of read flash(0: read ok, or -1: read error)
*/
int flash_indirect_read(uint32_t offset, void *data, int len)
{
    int cache_enabled = 0;
    int ret;

    if (is_flash_cache_enabled()) {
        flash_cache_disable();
        cache_enabled = 1;
    }

    if (is_sip_flash()) {
        ret = flash_read(offset, data, len);

    } else {
        if (!is_valid_flash_offset(offset) || data == NULL
            || len <= 0 || !is_valid_flash_offset(offset + len - 1)) {
            ret = -1;
            goto Exit;
        }
        __disable_irq();
        ret = qspi_flash_read(FLASH_START_QSPI + offset, data, len);
        __enable_irq();
    }

